//----------------------------------------------------------------------------

//Project:  Level Meter
//Compiler: IAR EWARM 6.50
//Target:   STM32F100C8T6B

//Linker->Extra options: --basic_heap
//Stack: TODO
//Heap: TODO

//----------------------------------------------------------------------------

#include "main.hpp"
#include "control.hpp"
#include "port.hpp"

//----------------------------- Переменные: ----------------------------------

TControl *Control;
TPort *Port;

//----------------------------------------------------------------------------
//------------------------- Основная программа: ------------------------------
//----------------------------------------------------------------------------

int main(void)
{
  TSysTimer::Init();        //инициализация системного таймера
  Control = new TControl(); //создание объекта управления
  Port = new TPort();       //создание объекта порта

  do                        //основной цикл
  {
    TSysTimer::Sync();      //синхронизация системных тиков с основным циклом
    Control->Execute();     //выполнение местного управления
    Port->Execute();        //выполнение команд компьютера
  }
  while(1);
}

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
