//----------------------------------------------------------------------------

//Модуль поддержки порта, заголовочный файл

//----------------------------------------------------------------------------

#ifndef PORT_HPP
#define PORT_HPP

//----------------------------------------------------------------------------

#include "wakeport.hpp"

//----------------------------------------------------------------------------
//------------------------------ Класс TPort ---------------------------------
//----------------------------------------------------------------------------

class TPort
{
private:
  static uint32_t const BAUD_RATE = 115200; //скорость обмена, бод
  static uint8_t const FRAME_SIZE = 128; //максимальный размер фрейма, байт
  uint8_t Command;
public:
  TWakePort *WakePort;
  TPort(void);
  void Execute(void);
};

//----------------------------------------------------------------------------
//----------------------- Коды специальных команд: ---------------------------
//----------------------------------------------------------------------------

enum
{
  CMD_STD_LAST = CMD_GETADDR,

  CMD_SET_MODE,   //установка режима
  CMD_GET_MODE,   //чтение режима
  CMD_GET_METER,  //чтение показаний (BarL, BarR, PeakL, PeakR)
  CMD_GET_STAT,   //чтение статистики (BarL, BarR, PeakL, PeakR)
  CMD_RES_STAT,   //сброс статистики
  CMD_SET_PARAMS, //установка параметров (Int1,2, Scl1,2, Res1,2, Hld1,2, Dec1,2)
  CMD_GET_PARAMS, //чтение параметров (Int1,2, Scl1,2, Res1,2, Hld1,2, Dec1,2)
  CMD_SET_TABLE,  //загрузка таблицы (Tab[0]..Tab[SEGS - 1])
  CMD_GET_TABLE,  //чтение таблицы (Tab[0]..Tab[SEGS - 1])
  CMD_EE_SAVE     //сохранение параметров в EEPROM
};

//----------------------------------------------------------------------------

#endif
