//----------------------------------------------------------------------------

//Класс поддержки последовательного регистра, заголовочный файл

//----------------------------------------------------------------------------

#ifndef SREG_HPP
#define SREG_HPP

//----------------------------------------------------------------------------
//----------------------------- Класс TSreg: ---------------------------------
//----------------------------------------------------------------------------

class TSreg
{
private:
  Pin_SCLK_t Pin_SCLK;
  Pin_SDATA_t Pin_SDATA;
  Pin_LOAD_t Pin_LOAD;
  Pin_OE_t Pin_OE;
  uint8_t Regs;
  void SpiWr(uint8_t d);
public:
  TSreg() {};
  void Init(uint8_t n);      //инициализация SPI
  void Load(uint8_t *Value); //загрузка регистра
  void Enable(bool en);      //разрешение/запрещение выходов регистра
};

//----------------------------------------------------------------------------

#endif
